{
    "title": "Construction Yard is live!",
    "date": "08-30-2020",
    "subtitles": [
        {
            "title": "What is Construction Yard?",
            "index": 0
        },
        {
            "title": "Is anything finished on it?",
            "index": 1
        },
        {
            "title": "Feedback",
            "index": 2
        }
    ],
    "content": [
        {
            "parent": 0,
            "text": "So I've been working on a site where I can host projects and apps written in Vue named Construction Yard. Named after the building in the Command and Conquer games that produces all the other buildings in the game, Construction Yard serves to do something very similar by hosting different apps to help out users with various tasks."
        },
        {
            "parent": 0,
            "text": "The plan is to create apps to aid students, developers and others in fields of computer graphics, data visualization, docker containerization and more!"
        },
        {
            "parent": 1,
            "text": "As of right now, the only app that is in a working state is 'Refinery'. Refinery is a WebGL app that allows users to manipulate a scene in 3D and download the contents in a JSON data format to be used in other projects. The app is to be used by the CMPT370 class of Macewan University this semester for help with their final project. All other apps are still in early beta forms and will continue to be worked on in the future."
        },
        {
            "parent": 1,
            "text": "I plan on making a video very soon to showcase how Refinery is meant to be used, I'll add an update here when said video is released as well as a link on Refinery itself to help with any confusion."
        },
        {
            "link": 1,
            "parent": 2,
            "text": "Please feel free to check out the site now and play around with Refinery, I'd love to hear what you think or what things could be changed to improve user experience or any bugs as I'm sure there are plenty! Check it out $link"
        }
    ],
    "links": [
        {
            "id": 1,
            "linkref": "http://constructionyard.ca/#/refinery",
            "linktext": "here."
        }
    ],
    "images": [
        {
            "id": 1,
            "imageRef": "refinery.png",
            "parent": 1,
            "width": 640,
            "height": 480
        }
    ]
}