{
    "title": "Semester over and graphics work",
    "date": "12-27-2019",
    "subtitles": [
        {
            "title": "So glad that semester is over!",
            "index": 0
        },
        {
            "title": "Graphics work",
            "index": 1
        }
    ],
    "content": [
        {
            "parent": 0,
            "text": "This semester was good but was stressful at the same time. I was really fortunate to take CMPT360 Intro to Operating Systems this semester which was a fantastic class. Learning about virtualization and process communication was probably the coolest part for me. I managed to pass all my classes fairly well, even though the non comp sci ones were very boring."
        },
        {
            "parent": 1,
            "text": "I was really fortunate to work with Dr.Cobzas, a professor at Macewan University who had approached me looking for help with her Intro to Graphics class. I really enjoyed that class last year, that being said I felt like I was not ready to help teach it in the labs for her! I decided to brush up on it quickly and was fortunate to get a hang of WebGL again quite quickly. I helped make the lab assignments for the class and then attended the lab to help answer any questions where I could kind of thing. WebGL was super fun to get back into and Dana was a huge help with learning even more than I did when I took the class as a student. I've never really pictured myself being a game developer or anything like that but if I could program graphics for work I'd gladly do so! It's a unique experience not being able to debug much because of the shader code not having any ways of logging values. I also plan on doing a graphics related capstone project next semester with Dr.Cobzas and am super excited about it. I'll do my best to upload some WebGL stuff on this site for showing a bit of how it works!"
        }
    ],
    "links": [
        {
            "id": 1,
            "linkref": "http://method1software.com/",
            "linktext": "here."
        }
    ]
}